*** Setting ***
Library  op_robot_tests.tests_files.service_keywords
Library  String
LIbrary  Collections
LIbrary  Selenium2Library
Library  DebugLibrary
Resource  keywords.robot
Resource  resource.robot
Suite Setup  TestCaseSetup
Suite Teardown  Close all browsers

*** Variables ***
${tender_dump_id}    0
${LOAD_BROKERS}    ['Quinta']
${LOAD_USERS}      ['Tender Viewer', 'Tender User', 'Tender Owner']

${tender_owner}   tender_owner    #Tender Owner
${provider}   Tender User
${viewer}   Tender Viewer

${item_id}       0
${question_id}   0

*** Test Cases ***
Можливість оголосити багатопредметний тендер 
  [Tags]   ${USERS.users['${USERS.tender_owner}'].broker}: Можливість оголосити багатопредметний тендер 
  Викликати для учасника     ${USERS.tender_owner}   Створити багатопредметний тендер
  ${LAST_MODIFICATION_DATE}=  Get Current Date
  Set Global Variable   ${LAST_MODIFICATION_DATE}
  
Отримати багатопредметний тендер по ідентифікатору
  [Tags]   ${USERS.users['${viewer}'].broker}: Пошук тендера по ідентифікатору
  Дочекатись синхронізації з майданчиком    ${viewer}
  Викликати для учасника   ${viewer}   Пошук тендера по ідентифікатору   ${TENDER_DATA.data.tenderID}   ${TENDER_DATA.data.id}  

Відображення опису позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера description
    
Відображення дати доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера deliveryDate.endDate

Відображення координат широти доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера deliveryLocation.latitude
  
Відображення координат довготи доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера deliveryLocation.longitude
  
Відображення назви нас. пункту доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера deliveryAddress.countryName

Відображення пошт коду доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера deliveryAddress.postalCode
  
Відображення регіону доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера deliveryAddress.region
  
Відображення locality адреси доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера deliveryAddress.locality
  
Відображення вулиці доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера deliveryAddress.streetAddress
  
Відображення схеми класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера classification.scheme
  
Відображення ідентифйікатора класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера classification.id
  
Відображення опису класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера classification.description
  
Відображення схеми додаткової класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера additionalClassifications.scheme
  
Відображення ідентифікатора додаткової класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера additionalClassifications.id
  
Відображення опису додаткової класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера additionalClassifications.description
  
Відображення назви одиниці позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера unit.name
    
Відображення коду одиниці позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера unit.code
  
Відображення кількості позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопредметного тендера quantity
    
    
