*** Setting ***
Library  op_robot_tests.tests_files.service_keywords
Library  String
LIbrary  Collections
LIbrary  Selenium2Library
Library  DebugLibrary
Resource  keywords.robot
Suite Setup  TestCaseSetup
Suite Teardown  Close all browsers

*** Variables ***
${viewer}    Tender User
# Tender Viewer
${provider}   Tender User


*** Test Cases ***
Можливість оголосити багатопредметний тендер 
  [Tags]   ${USERS.users['${USERS.tender_owner}'].broker}: Можливість оголосити багатопредметний тендер 
  Викликати для учасника     ${USERS.tender_owner}   Створити багатопредметний тендер
  ${LAST_MODIFICATION_DATE}=  Get Current Date
  Set Global Variable   ${LAST_MODIFICATION_DATE}
  
Отримати багатопредметний тендер по ідентифікатору
  [Tags]   ${USERS.users['${viewer}'].broker}: Пошук тендера по ідентифікатору
  Дочекатись синхронізації з майданчиком    ${viewer}
  Викликати для учасника   ${viewer}   Пошук тендера по ідентифікатору   ${TENDER_DATA.data.tenderID}   ${TENDER_DATA.data.id}  

Відображення опису позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера description
    
Відображення дати доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера deliveryDate.endDate

Відображення координат широти доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера deliveryLocation.latitude
  
Відображення координат довготи доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера deliveryLocation.longitude
  
Відображення назви нас. пункту доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера deliveryAddress.countryName

Відображення пошт коду доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера deliveryAddress.postalCode
  
Відображення регіону доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера deliveryAddress.region
  
Відображення locality адреси доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера deliveryAddress.locality
  
Відображення вулиці доставки позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера deliveryAddress.streetAddress
  
Відображення схеми класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера classification.scheme
  
Відображення ідентифйікатора класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера classification.id
  
Відображення опису класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера classification.description
  
Відображення схеми додаткової класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера additionalClassifications.scheme
  
Відображення ідентифікатора додаткової класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера additionalClassifications.id
  
Відображення опису додаткової класифікації позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера additionalClassifications.description
  
Відображення назви одиниці позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера unit.name
    
Відображення коду одиниці позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера unit.code
  
Відображення кількості позицій закупівлі багатопредметного тендера
  [Tags]   ${USERS.users['${viewer}'].broker}: Відображення полів пердметів багатопредметного тендера
  Звірити поля предметів закупівлі багатопрредметного тендера quantity
    
    
