*** Settings ***
Resource           limited_keywords.robot
Suite Setup        Test Suite Setup
Suite Teardown     Close all browsers


*** Variables ***
${mode}         negotiation.quick
${role}         viewer
${broker}       Quinta


*** Test Cases ***
##############################################################################################
#             CANCELLATIONS
##############################################################################################
Можливість створити швидку переговорну закупівлю для тестування скасування
  [Tags]  ${USERS.users['${tender_owner}'].broker}: Можливість створити швидку переговорну закупівлю для тестування скасування
  ...  tender_owner
  ...  ${USERS.users['${tender_owner}'].broker}
  ...  minimal
  Можливість створити закупівлю для тестування скасування


Можливість скасувати швидку переговорну закупівлю
  [Tags]  ${USERS.users['${tender_owner}'].broker}: Можливість скасувати швидку переговорну закупівлю
  ...  tender_owner
  ...  ${USERS.users['${tender_owner}'].broker}
  ...  level2
  Можливість скасувати закупівлю


Відображення активного статусу скасування швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення активного статусу скасування швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  [Setup]  Дочекатись синхронізації з майданчиком  ${viewer}
  Відображення активного статусу скасування закупівлі


Відображення причини скасування швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення причини скасування швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення причини скасування закупівлі


Відображення опису документа скасування швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення опису документа скасування швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення опису документа скасування закупівлі


Відображення заголовку документа скасування швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення заголовку документа скасування швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення заголовку документа скасування закупівлі

##############################################################################################
#             MAIN
##############################################################################################

Можливість створити швидку переговорну закупівлю
  [Tags]  ${USERS.users['${tender_owner}'].broker}: Можливість створити швидку переговорну закупівлю
  ...  tender_owner
  ...  ${USERS.users['${tender_owner}'].broker}
  ...  minimal
  Можливість створити закупівлю


Можливість знайти швидку переговорну закупівлю по ідентифікатору
  [Tags]  ${USERS.users['${viewer}'].broker}: Можливість знайти швидку переговорну закупівлю по ідентифікатору
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  ...  minimal
  Можливість знайти закупівлю по ідентифікатору


Можливість модифікації швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${tender_owner}'].broker}: Можливість модифікації швидкої переговорної закупівлі
  ...  tender_owner
  ...  ${USERS.users['${tender_owner}'].broker}
  ...  level2
  Можливість модифікації закупівлі


Можливість додати документацію до швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${tender_owner}'].broker}: Можливість додати тендерну документацію до швидкої переговорної закупівлі
  ...  tender_owner
  ...  ${USERS.users['${tender_owner}'].broker}
  ...  level2
  Можливість додати документацію до закупівлі


Можливість зареєструвати і підтвердити постачальника до швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${tender_owner}'].broker}: Можливість зареєструвати і підтвердити постачальника до швидкої переговорної закупівлі
  ...  tender_owner
  ...  ${USERS.users['${tender_owner}'].broker}
  ...  minimal
  Можливість зареєструвати і підтвердити постачальника до закупівлі

##############################################################################################
#             MAIN DATA
##############################################################################################

Відображення заголовку швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення заголовку швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  [Setup]  Дочекатись синхронізації з майданчиком  ${viewer}
  Відображення заголовку закупівлі


Відображення ідентифікатора швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення ідентифікатора швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення ідентифікатора закупівлі

##############################################################################################
#             MAIN DATA.VALUE
##############################################################################################

Відображення бюджету швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення бюджету швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення бюджету закупівлі


Відображення валюти швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення валюти швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення валюти закупівлі


Відображення врахованого податку в бюджет швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення врахування податку в бюджет швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення врахованого податку в бюджет закупівлі

##############################################################################################
#             MAIN DATA.PROCURING ENTITY
##############################################################################################

Відображення країни замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення країни замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення країни замовника закупівлі


Відображення населеного пункту замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення населеного пункту замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення населеного пункту замовника закупівлі


Відображення поштового коду замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення поштового коду замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення поштового коду замовника закупівлі


Відображення області замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення області замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення області замовника закупівлі


Відображення вулиці замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення вулиці замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення вулиці замовника закупівлі


Відображення контактного імені замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення контактного імені замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення контактного імені замовника закупівлі


Відображення контактного телефону замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення контактного телефону замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення контактного телефону замовника закупівлі


Відображення сайту замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення сайту замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення сайту замовника закупівлі


Відображення офіційного імені замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення офіційного імені замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення офіційного імені замовника закупівлі


Відображення схеми ідентифікації замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення схеми ідентифікації замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення схеми ідентифікації замовника закупівлі


Відображення ідентифікатора замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення ідентифікатора замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення ідентифікатора замовника закупівлі


Відображення імені замовника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення імені замовника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення імені замовника закупівлі

##############################################################################################
#             MAIN DATA.ITEMS
##############################################################################################

Відображення опису додаткової класифікації номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення опису додаткової класифікації номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення опису додаткової класифікації номенклатури закупівлі


Відображення ідентифікатора додаткової класифікації номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення ідентифікатора додаткової класифікацій номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення ідентифікатора додаткової класифікації номенклатури закупівлі


Відображення схеми додаткової класифікації номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення схеми додаткової класифікації номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення схеми додаткової класифікації номенклатури закупівлі


Відображення схеми класифікації номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення схеми класифікації номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення схеми класифікації номенклатури закупівлі


Відображення ідентифікатора класифікації номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення ідентифікатора класифікації номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення ідентифікатора класифікації номенклатури закупівлі


Відображення опису класифікації номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення опису класифікації номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення опису класифікації номенклатури закупівлі


Відображення опису номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення опису номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення опису номенклатури закупівлі


Відображення ідентифікатора номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення ідентифікатора номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення ідентифікатора номенклатури закупівлі


Відображення кількості номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення кількості номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення кількості номенклатури закупівлі


Відображення назви одиниці номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення назви одиниці номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення назви одиниці номенклатури закупівлі


Відображення коду одиниці номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення коду одиниці номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення коду одиниці номенклатури закупівлі


Відображення дати доставки номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення дати доставки номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення дати доставки номенклатури закупівлі


Відображення координат широти доставки номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення координат широти доставки номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення координат широти доставки номенклатури закупівлі


Відображення координат довготи доставки номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення координат довготи доставки номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення координат довготи доставки номенклатури закупівлі


Відображення назви нас. пункту доставки номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення назви нас. пункту доставки номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення назви нас. пункту доставки номенклатури закупівлі


Відображення назви нас. пункту російською мовою доставки номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення назви нас. пункту російською мовою доставки номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення назви нас. пункту російською мовою доставки номенклатури закупівлі


Відображення назви нас. пункту англійською мовою доставки номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення назви нас. пункту англійською мовою доставки номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення назви нас. пункту англійською мовою доставки номенклатури закупівлі


Відображення пошт. коду доставки номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення пошт. коду доставки номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення пошт. коду доставки номенклатури закупівлі


Відображення регіону доставки номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення регіону доставки номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення регіону доставки номенклатури закупівлі


Відображення населеного пункту адреси доставки номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення населеного пункту адреси доставки номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення населеного пункту адреси доставки номенклатури закупівлі


Відображення вулиці доставки номенклатури швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення вулиці доставки номенклатури швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення вулиці доставки номенклатури закупівлі

##############################################################################################
#             DOCUMENTS
##############################################################################################

Відображення заголовку документа швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення заголовку документа швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення заголовку документа закупівлі

##############################################################################################
#             AWARDS
##############################################################################################

Відображення підтвердженого постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення підтвердженого постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення підтвердженого постачальника закупівлі


Відображення країни постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення країни постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення країни постачальника закупівлі


Відображення міста постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення міста постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення міста постачальника закупівлі


Відображення поштового коду постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення поштового коду постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення поштового коду постачальника закупівлі


Відображення області постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення області постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення області постачальника закупівлі


Відображення вулиці постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення вулиці постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення вулиці постачальника закупівлі


Відображення контактного телефону постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення контактного телефону постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення контактного телефону постачальника закупівлі


Відображення контактного імені постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення контактного імені постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення контактного імені постачальника закупівлі


Відображення контактного імейлу постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення контактного імейлу постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення контактного імейлу постачальника закупівлі


Відображення схеми ідентифікації постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення схеми ідентифікації постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення схеми ідентифікації постачальника закупівлі


Відображення офіційного імені постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення офіційного імені постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення офіційного імені постачальника закупівлі


Відображення ідентифікатора постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення ідентифікатора постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення ідентифікатора постачальника закупівлі


Відображення імені постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення імені постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення імені постачальника закупівлі


Відображення врахованого податку до ціни номенклатури постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення врахованого податку до ціни номенклатури постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення врахованого податку до ціни номенклатури постачальника закупівлі


Відображення валюти ціни номенклатури постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення валюти ціни номенклатури постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення валюти ціни номенклатури постачальника закупівлі


Відображення вартості номенклатури постачальника швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення валюти ціни номенклатури постачальника швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  Відображення вартості номенклатури постачальника закупівлі

##############################################################################################
#             CONTRACTS
##############################################################################################

Неможливість укласти угоду для швидкої переговорної закупівлі поки не пройде stand-still період
  [Tags]  ${USERS.users['${tender_owner}'].broker}: Неможливість укласти угоду для швидкої переговорної закупівлі поки не пройде stand-still період
  ...  ${tender_owner}
  ...  ${USERS.users['${tender_owner}'].broker}
  [Setup]  Дочекатись синхронізації з майданчиком  ${tender_owner}
  Неможливість укласти угоду для закупівлі поки не пройде stand-still період


Відображення статусу непідписаної угоди з постачальником швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення статусу підписаної угоди з постачальником швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  [Setup]  Дочекатись синхронізації з майданчиком  ${viewer}
  Відображення статусу непідписаної угоди з постачальником закупівлі


Можливість укласти угоду для швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${tender_owner}'].broker}: Можливість укласти угоду для швидкої переговорної закупівлі
  ...  ${tender_owner}
  ...  ${USERS.users['${tender_owner}'].broker}
  [Setup]  Дочекатись синхронізації з майданчиком  ${tender_owner}
  Можливість укласти угоду для закупівлі


Відображення статусу підписаної угоди з постачальником швидкої переговорної закупівлі
  [Tags]  ${USERS.users['${viewer}'].broker}: Відображення статусу підписаної угоди з постачальником швидкої переговорної закупівлі
  ...  viewer
  ...  ${USERS.users['${viewer}'].broker}
  [Setup]  Дочекатись синхронізації з майданчиком  ${viewer}
  Відображення статусу підписаної угоди з постачальником закупівлі
